<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of HP's Printer Drivers directly from HP and renames the PKG.</string>
    <key>Identifier</key>
    <string>com.github.primalcurve.pkg.HPPrinterDrivers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HPPrinterDrivers</string>
        <key>PRODUCT_NUMBER</key>
        <string>E6B70A</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>ParentRecipe</key>
    <string>com.github.n8felton.download.HPPrinterDrivers</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/downloads/unpack/hp-printer-essentials*.version.pkg/PackageInfo</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.primalcurve.shared/PackageInfoReader</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_info_path</key>
                <string>%found_filename%</string>
                <key>target_key</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>